Renova/src/DataProcessors/ЗагрузкаВидовПродукции/ЗагрузкаВидовПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВидовПродукции</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаблицаЗагрузки</name>
    <type>
      <types>ValueTable</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Renova/src/Catalogs/ВидыПродукции/ВидыПродукции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыПродукции</name>
  <predefined>
    <items>
      <name>Общий</name>
      <description>Общий</description>
    </items>
  </predefined>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDСайта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Renova/src/DataProcessors/ЗагрузкаВидовПродукции/Forms/Форма/Module.bsl
#Область ОбработчикиКомандФормы

&НаКлиенте 
Асинх Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
    
    ПараметрыФайла  = Новый Структура;
    ПараметрыФайла .Вставить("ИдентификаторФормы", УникальныйИдентификатор);
    
    Результат = Ждать РаботаСФайломКлиент.ВыбратьФайл(ПараметрыФайла);
    
    Если Результат.ФайлВыбран Тогда
        Объект.ПутьКФайлу = Результат.ПутьКФайлу;
    Иначе
        ПоказатьПредупреждение(,"Файл не выбран");
    КонецЕсли;
	
КонецПроцедуры
	
&НаКлиенте   
Процедура Загрузить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.ПутьКФайлу) Тогда
		ПоказатьПредупреждение(, "Выберите файл для загрузки");
		Возврат;
	КонецЕсли;
	
	ЗагрузитьНаСервере();
	Сообщить("Строк в таблице: " + Объект.ТаблицаЗагрузки.Количество());
	
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда) 
	
	Если НЕ ЗначениеЗаполнено(Объект.ТаблицаЗагрузки) Тогда
		ПоказатьПредупреждение(, "Загрузите файл в таблицу");
		Возврат;
	КонецЕсли; 
	
	СохранитьНаСервере();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьНаСервере() 
	
	ТЗ = РаботаСCSVСервер.ПрочитатьФайлCSV(Объект.ПутьКФайлу);

	РаботаСФормамиСервер.ОбновитьДинамическуюТаблицу(ЭтаФорма, "Объект.ТаблицаЗагрузки", "ТЗ","ДанныеЗагрузки", ТЗ);
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	
	СозданоЭлементов = 0;
	ТаблицаДанных = Объект.ТаблицаЗагрузки.Выгрузить();
	КоличествоСтрокВТаблице = ТаблицаДанных.Количество();
	Для каждого СтрокаДанных из ТаблицаДанных Цикл
		НовыйЭлемент = Справочники.ВидыПродукции.СоздатьЭлемент();
		НовыйЭлемент.IDСайта = РаботаСоСтрокойСервер.БезопасноеПреобразованиеВЧисло(СтрокаДанных.id);
		НовыйЭлемент.Наименование = СтрокаДанных.title;
		НовыйЭлемент.КраткоеНаименование = СтрокаДанных.short_title;
		НовыйЭлемент.Записать();
		СозданоЭлементов = СозданоЭлементов + 1;
	КонецЦикла;
	
	Сообщение = Новый СообщениеПользователю; 
	Текст = СтрШаблон("В Таблице содержится %1 строк.
						|Загружено и создано %2 элементов справочника", КоличествоСтрокВТаблице, СозданоЭлементов);
	Сообщение.Текст = Текст;
	Сообщение.Сообщить();

КонецПроцедуры


#КонецОбласти
